fireFoamCases/case1/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    f0;
        type    faceSet;
        action  new;
        source  boxToFace;
           //box     (50 0 9.97) (100 0.01 13.97);
           //box     (100 0 9.97) (105 0.01 13.97);
	   box     (100 0 10.97) (105 0.01 12.97);
	   //box     (150 0 10.97) (155 0.01 12.97);
    }
    {
        name    f0;
        type    faceSet;
        action  add;
        source  boxToFace;
           //box     (50 0 9.97) (100 0.01 13.97);
           //box     (100 0 9.97) (105 0.01 13.97);
           //box     (100 0 10.97) (105 0.01 12.97);
           box     (150 0 10.97) (155 0.01 12.97);
    }
);


// ************************************************************************* //
